In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("salaries.csv")

In [3]:
df.head()

    ID      NAME  SALARY
0  101  SAROJINI  100000
1  102    JHANSI  150000
2  103    KAMALA  200000
3  104      ARAN  150000

In [4]:
df.columns

Index(['ID', 'NAME', 'SALARY'], dtype='object')

In [5]:
df[df['SALARY']>100000]

    ID    NAME  SALARY
1  102  JHANSI  150000
2  103  KAMALA  200000
3  104    ARAN  150000

In [6]:
df.shape

(4, 3)

In [7]:
if(df[df['SALARY']==150000].shape[0]>1):
    print("?\t?\t150000")
elif(df[df['SALARY']==150000].shape[0]==1):
    print(df[df['SALARY']==150000])

?	?	150000

In [8]:
df.dtypes

ID         int64
NAME      object
SALARY     int64
dtype: object

In [9]:
sorted=df.sort_values(by=["SALARY"])
sorted

    ID      NAME  SALARY
0  101  SAROJINI  100000
1  102    JHANSI  150000
3  104      ARAN  150000
2  103    KAMALA  200000

# find S algorithm

In [18]:
df1=pd.read_csv("EnjoySport.csv")
df1

     Sky AirTemp Humidity    Wind Water Forecast EnjoySport
0  Sunny    Warm   Normal  Strong  Warm     Same        Yes
1  Sunny    Warm     High  Strong  Warm     Same        Yes
2  Rainy    Cold     High  Strong  Warm   Change         No
3  Sunny    Warm     High  Strong  Cool   Change        Yes

In [19]:
df1.shape

(4, 7)

In [20]:
print("initial specific hypothesis:h{ϕ, ϕ, ϕ, ϕ, ϕ, ϕ}")

initial specific hypothesis:h{ϕ, ϕ, ϕ, ϕ, ϕ, ϕ}

In [21]:
df1=df1[df1["EnjoySport"]=="Yes"]   
df1=df1.iloc[:,0:-1]
df1

     Sky AirTemp Humidity    Wind Water Forecast
0  Sunny    Warm   Normal  Strong  Warm     Same
1  Sunny    Warm     High  Strong  Warm     Same
3  Sunny    Warm     High  Strong  Cool   Change

In [22]:
df1.reset_index()

   index    Sky AirTemp Humidity    Wind Water Forecast
0      0  Sunny    Warm   Normal  Strong  Warm     Same
1      1  Sunny    Warm     High  Strong  Warm     Same
2      3  Sunny    Warm     High  Strong  Cool   Change

In [15]:
import numpy as np

In [24]:
specific_hypothesis=np.array(df1.iloc[0,:])
specific_hypothesis

array(['Sunny', 'Warm', 'Normal', 'Strong', 'Warm', 'Same'], dtype=object)

In [25]:
for i in range(1,df1.shape[0]):
    for j in range(df1.shape[1]):
        if(df1.iloc[i,j]!=specific_hypothesis[j]):
            specific_hypothesis[j]="?"

In [26]:
print("The final specific hypothesis is",specific_hypothesis)

The final specific hypothesis is ['Sunny' 'Warm' '?' 'Strong' '?' '?']

### Method

In [34]:
l=np.array(["Sunny","Cold","High","Strong","Warm","Same"])
print(l)
l1=np.array(["Sunny","Cold","Normal","Strong","Cool","Same"])

['Sunny' 'Cold' 'High' 'Strong' 'Warm' 'Same']

In [35]:
def method(l):
    for i in range(len(l)):
        if(l[i]!=specific_hypothesis[i]):
            specific_hypothesis[i]="?"
method(l)
print(specific_hypothesis)

['Sunny' '?' '?' 'Strong' '?' '?']

### Testing if an example is negative or positive

In [45]:
x=0
def test(l1):
    for i in range(len(l1)):
        if(l1[i]!=specific_hypothesis[i] and specific_hypothesis[i]!="?"):
            return 1
        break

In [46]:
if(test(l1)==1):
    print("a negative training example")
else:
    print("a positive training example")

a positive training example